mauroSilvaR/adding-BLE-service-to-nrf52832/2/main.c
/**@brief Struct that contains pointers to the encoded advertising data. */
static ble_gap_adv_data_t m_adv_data =
{
    .adv_data =
    {
        .p_data = m_enc_advdata,
        .len    = BLE_GAP_ADV_SET_DATA_SIZE_MAX
    },
    .scan_rsp_data =
    {
        .p_data = m_enc_scan_response_data,
        .len    = BLE_GAP_ADV_SET_DATA_SIZE_MAX

    }
};

/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
	  
}


/**@brief Function for the LEDs initialization.
 *
 * @details Initializes all LEDs used by the application.
 */
static void leds_init(void)
{
    bsp_board_init(BSP_INIT_LEDS);
	
}


/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module.
 */
static void timers_init(void)
{
    // Initialize timer module, making it use the scheduler
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
	
}


/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
    ret_code_t              err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;
    
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);
    
    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);
   
    memset(&gap_conn_params, 0, sizeof(gap_conn_params));
   
    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;
    
    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
																					
}


/**@brief Function for initializing the GATT module.
 */
static void gatt_init(void)
{
    ret_code_t err_code = nrf_ble_gatt_init(&m_gatt, NULL);
    APP_ERROR_CHECK(err_code);
	  
}


/**@brief Function for initializing the Advertising functionality.
 *
 * @details Encodes the required advertising data and passes it to the stack.
 *          Also builds a structure to be passed to the stack when starting advertising.
 */
static void advertising_init(void)
{
    ret_code_t    err_code;
    ble_advdata_t advdata;
    ble_advdata_t srdata;
	  NRF_LOG_INFO("101");
	  
//essa é a maneira correta de instanciar os diferentes tipos de serviço, um por vez e com a tag do BLE UUID
    ble_uuid_t adv_uuids[] = {
		{LBS_UUID_SERVICE, m_lbs.uuid_type},
		{SERV_UUID_SERVICE,BLE_UUID_TYPE_BLE}
		
		
		};                                                             //coloco o uuid do
		                                                               //adv packet
		                                                               //esse é o UUID que vai aparecer bem na parte
		                                                               //do nrf connect onde tem o nome do serviço
	//eu acho que se for mais de um é só ir colocando, tipo assim ble_uuid_t_adv_uuids[]={{S1,Inst1},{S2,inst2}}
//{LBS_UUID_SERVICE, BLE_UUID_TYPE_BLE},
//		{SERV_UUID_SERVICE,BLE_UUID_TYPE_BLE}
    // Build and set advertising data.
		
    memset(&advdata, 0, sizeof(advdata));
    
    advdata.name_type          = BLE_ADVDATA_FULL_NAME;
		
    advdata.include_appearance = true;
		
    advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
    

    memset(&srdata, 0, sizeof(srdata));
		
    srdata.uuids_complete.uuid_cnt = sizeof(adv_uuids) / sizeof(adv_uuids[0]);
															
    srdata.uuids_complete.p_uuids  = adv_uuids;
    
		
    err_code = ble_advdata_encode(&advdata, m_adv_data.adv_data.p_data, &m_adv_data.adv_data.len);
    APP_ERROR_CHECK(err_code);
		

    err_code = ble_advdata_encode(&srdata, m_adv_data.scan_rsp_data.p_data, &m_adv_data.scan_rsp_data.len);
		APP_ERROR_CHECK(err_code);
    
		
    ble_gap_adv_params_t adv_params;
    
    // Set advertising parameters.
    memset(&adv_params, 0, sizeof(adv_params));

    adv_params.primary_phy     = BLE_GAP_PHY_1MBPS;
    adv_params.duration        = APP_ADV_DURATION;
    adv_params.properties.type = BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED;
    adv_params.p_peer_addr     = NULL;
    adv_params.filter_policy   = BLE_GAP_ADV_FP_ANY;
    adv_params.interval        = APP_ADV_INTERVAL;

    err_code = sd_ble_gap_adv_set_configure(&m_adv_handle, &m_adv_data, &adv_params);
    APP_ERROR_CHECK(err_code);
		
}


/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for handling write events to the LED characteristic.
 *
 * @param[in] p_lbs     Instance of LED Button Service to which the write applies.
 * @param[in] led_state Written/desired state of the LED.
 */
//essa é a função que vai fazer o trabalho duro em si
//aqui vc consegue controlar diversos parâmetros da placa
static void led_write_handler(uint16_t conn_handle, ble_lbs_t * p_lbs, uint8_t led_state)
{
    if (led_state)
			
    {  	bsp_board_led_on(LEDBUTTON_LED);
    }
    else
    {
        bsp_board_led_off(LEDBUTTON_LED);
        NRF_LOG_INFO("Received LED OFF!");
    }
}

//copiei a função para o led 2
static void led2_write_handler(uint16_t conn_handle, ble_lbs_t * p_lbs, uint8_t led2_state)
{
    if (led2_state)
    {
        bsp_board_led_on(LEDBUTTON_LED2);
			
        NRF_LOG_INFO("Received LED ON3!");//isso é só pra monitorar o erro na serial, com uso de putty e Jtag
    }
    else
    {
        bsp_board_led_off(LEDBUTTON_LED2);
        NRF_LOG_INFO("Received LED OFF3!");
    }
}


static void log_write_handler(uint16_t conn_handle, meu_serv_t * p_lbs, uint8_t log_state)
{
	//uint8_t te permite mandar um número até 255
	NRF_LOG_INFO("%d",log_state);
//    if (log_state==6)
//    {
//        NRF_LOG_INFO("PEPEEEEE! JÁ COLOQUEI A VELA!");//isso é só pra monitorar o erro na serial, com uso de putty e Jtag
//    }
//    else
//    {
//        NRF_LOG_INFO("PEPEEEEE! JÁ TIREI A VELA!");
//    }
}


/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
    ret_code_t         err_code;
    ble_lbs_init_t     init     = {0};//struct de inicialização do serviço
		nrf_ble_qwr_init_t qwr_init = {0};
		meu_serv_init_t    serv_init ={0};//struct de inicialização de um serviço
		//pode ser que precise do qwr
		
